using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TODO
{
    /* TODO:
     
        Андрей, сейчас 4:52 утра. Я вроде как допилил стандартную догику.
        Сделай пожалуйста UI хоть какой-нибудь для тестов. 

    StandartLogic standartLogic = new StandartLogic(); Используй этот объект для тестов.

    standartLogic.GetCurrentPlayingMap(); Используй для получения текущей игровой карты с размещенными объектами.
    Скорее всего будешь использовать для первого фрэйма. Даже не скорее всего, а так и делай.

    standartLogic.GetNextPlayingMap(); Используй для отрисовки последующий кадров. Между вызовами делай паузы 0,5 - 1 сек.

        Меня конкретно уже вырубает. Сейчас запушу проэкт и спать. 5:05 капец. До каких 14:00 я буду оффлайн. Удачи
    
    */
}
